app/controllers/educacaos_controller.rb

  def index
    @educacaos = Educacao.all
---
SELECT "educacaos".* FROM "educacaos"

    def set_educacao
      @educacao = Educacao.find(params[:id])
---
SELECT "educacaos".* FROM "educacaos" WHERE "educacaos"."id" = $1 LIMIT 1  [["id", "1"]]